tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "homebrew/core"
brew "m4"
brew "coreutils"
brew "asdf"
brew "bash"
brew "cheat"
brew "clang-format"
brew "curl"
brew "direnv"
brew "ffmpeg"
brew "gawk"
brew "gh"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "htop"
brew "imagemagick"
brew "lf"
brew "mas" if OS.mac?
brew "neofetch"
brew "pandoc"
brew "rsync"
brew "shellcheck"
brew "speedtest-cli"
brew "starship"
brew "stow"
brew "tmux"
brew "tree"
brew "watchman"
brew "wget"
brew "youtube-dl"
